In [8]:
import pandas as pd

capitals = pd.DataFrame(
    [
    ["Ngerulmud",391,1.87],
    ["Vatican City",826,100],
    ["Yaren",1100,10.91],
    ["Funafuti",4492,45.48],   
    ["City of San Marino",4493]
    ],
    index = ["Palau", "Vatican City", "Nauru", "Tuvalu", "San Marino"],
    columns = ['Capital','Population','Percentage']
)

In [9]:
capitals

                         Capital  Population  Percentage
Palau                  Ngerulmud         391        1.87
Vatican City        Vatican City         826      100.00
Nauru                      Yaren        1100       10.91
Tuvalu                  Funafuti        4492       45.48
San Marino    City of San Marino        4493         NaN

In [10]:
capitals.loc['Nauru','Population']

1100

In [11]:
capitals.loc['Palau':'Nauru', ['Population','Percentage']]

              Population  Percentage
Palau                391        1.87
Vatican City         826      100.00
Nauru               1100       10.91

In [12]:
capitals.iloc[[1,3]]

                   Capital  Population  Percentage
Vatican City  Vatican City         826      100.00
Tuvalu            Funafuti        4492       45.48

In [31]:
capitals.iloc[[1,3], 1:2]

              Population
Vatican City         826
Tuvalu              4492

In [35]:
capitals

                         Capital  Population  Percentage
Palau                  Ngerulmud         391        1.87
Vatican City        Vatican City         826      100.00
Nauru                      Yaren        1100       10.91
Tuvalu                  Funafuti        4492       45.48
San Marino    City of San Marino        4493         NaN

In [43]:
capitals

                         Capital  Population  Percentage
Palau                  Ngerulmud         391        1.87
Vatican City        Vatican City         826      100.00
Nauru                      Yaren        1100       10.91
Tuvalu                  Funafuti        4492       45.48
San Marino    City of San Marino        4493         NaN

In [51]:
import numpy as np
import pandas as pd

In [15]:
grades = pd.read_csv('~/healtheintent/capitals/grades.csv') 
grades = grades.set_index('student')

In [16]:
grades

         test_1  test_2
student
John         90      85
Steve        52      75
Golden       78      75
Mary        100      89
Suzi         68      92
Andrea       82      66

In [17]:
grades[grades['test_2'] < grades['test_1']]

         test_1  test_2
student
John         90      85
Golden       78      75
Mary        100      89
Andrea       82      66

In [93]:
grades

         test_1  test_2
student
John         90      85
Steve        52      75
Golden       78      75
Mary        100      89
Suzi         68      92
Andrea       82      66

In [121]:
grades.loc[['Steve','Suzi'], ['test_1','test_2']] += 1

grades.loc['Andrea'] = [85,78]

grades

         test_1  test_2
student
John         90      85
Steve        78      92
Golden       78      75
Mary        100      89
Suzi         94     109
Andrea       85      78